In [1]:
import pandas as pd
import numpy as np

# Find credit card status based on the customer data

In [2]:
cards = pd.read_csv("C:/Users/go27s/OneDrive/Documents/Udemy/Statistics and Probability/Statistics/credit_card.csv")
cards.head(3)

,gender,age,job,marital,education,default,housing,loan,contact,CreditCard
0,female,56,housemaid,married,basic.4y,no,no,no,telephone,no
1,male,57,services,married,high.school,yes,no,no,telephone,no
2,female,37,services,married,high.school,no,yes,no,telephone,no

In [3]:
cards.shape

(41188, 10)

In [10]:
cards.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41188 entries, 0 to 41187
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   gender      41188 non-null  object
 1   age         41188 non-null  int64
 2   job         41188 non-null  object
 3   marital     41188 non-null  object
 4   education   41188 non-null  object
 5   default     41188 non-null  object
 6   housing     41188 non-null  object
 7   loan        41188 non-null  object
 8   contact     41188 non-null  object
 9   CreditCard  41188 non-null  object
dtypes: int64(1), object(9)
memory usage: 3.1+ MB

In [11]:
cards.describe(include='object')  # describing mode value of the obect columns

,gender,job,marital,education,default,housing,loan,contact,CreditCard
count,41188,41188,41188,41188,41188,41188,41188,41188,41188
unique,2,12,4,8,2,2,2,2,2
top,female,admin.,married,university.degree,no,yes,no,cellular,no
freq,20798,10422,24928,12168,32588,22566,33950,26144,36548

# What is the Probability that the Customer has no Credit Card?
Marginal Probability - probability distribution of Random Variables INDIVIDUALLY.

In [14]:
# shape gives us number of rows and columns  41188, 10
customers = cards.shape[0]
customers

41188

In [19]:
no_card = len(cards[cards['CreditCard'] == 'no'])
no_card

36548

In [21]:
# divide number of events(no_card) by sample space(customers)
p = round(no_card/customers, 3)
print(f"The probability that the Customer doesn't have a Credit Card is {p}")

The probability that the Customer doesn't have a Credit Card is 0.887

# What is the Probability that the Customer is illiterate?
Marginal Probability - probability distribution of Random Variables INDIVIDUALLY.

In [22]:
cards['education'].unique()

array(['basic.4y', 'high.school', 'basic.6y', 'basic.9y',
       'professional.course', 'unknown', 'university.degree',
       'illiterate'], dtype=object)

In [23]:
cards['education'].value_counts()

university.degree      12168
high.school             9515
basic.9y                6045
professional.course     5243
basic.4y                4176
basic.6y                2292
unknown                 1731
illiterate                18
Name: education, dtype: int64

In [24]:
# sample space --> illiterate
illiterate = 18

In [28]:
p = illiterate/customers
print(f"The Probability that the Customer is illiterate is {p}")

The Probability that the Customer is illiterate is 0.0004370204914052637

# What is the Probability that the Customer has a phone?
Marginal Probability - probability distribution of Random Variables INDIVIDUALLY.

In [31]:
cards['contact'].value_counts()

cellular     26144
telephone    15044
Name: contact, dtype: int64

In [35]:
# sample space
telephone = len(cards[cards['contact'] == 'telephone'])
telephone

15044

In [36]:
p = round(telephone/customers, 3)
p

0.365

# What is the Probability that a Customer is Single and has a Credit Card?
Joint Probability -  probability of two or more events occurring at the same time P(X,Y)

In [37]:
cards.head(2)

,gender,age,job,marital,education,default,housing,loan,contact,CreditCard
0,female,56,housemaid,married,basic.4y,no,no,no,telephone,no
1,male,57,services,married,high.school,yes,no,no,telephone,no

In [38]:
cards['marital'].value_counts()

married     24928
single      11568
divorced     4612
unknown        80
Name: marital, dtype: int64

In [43]:
pd.crosstab(cards['marital'], cards['CreditCard'], margins=True, margins_name='Total')

CreditCard     no   yes  Total
marital
divorced     4136   476   4612
married     22396  2532  24928
single       9948  1620  11568
unknown        68    12     80
Total       36548  4640  41188

In [41]:
# sample space
status_cards = len(cards[(cards['marital'] =='single') & (cards['CreditCard'] =='yes')])
status_cards

1620

In [46]:
p = round(status_cards / customers, 3)
p

0.039

# What is the Probability that the Customer is Male and has at most 6 Year of Education?
Joint Probability

In [47]:
cards.head(2)

,gender,age,job,marital,education,default,housing,loan,contact,CreditCard
0,female,56,housemaid,married,basic.4y,no,no,no,telephone,no
1,male,57,services,married,high.school,yes,no,no,telephone,no

In [48]:
pd.crosstab(cards['gender'], cards['education'], margins=True, margins_name='Total')

education,basic.4y,basic.6y,basic.9y,high.school,illiterate,professional.course,university.degree,unknown,Total
gender,,,,,,,,,
female,2104,1169,3092,4735,7,2647,6142,902,20798
male,2072,1123,2953,4780,11,2596,6026,829,20390
Total,4176,2292,6045,9515,18,5243,12168,1731,41188

In [53]:
male_6year = len(cards[(cards['gender'] == 'male') & (cards['education'].isin(['basic.4y', 'basic.6y', 'illiterate']))])
male_6year

3206

In [54]:
p = round(male_6year/customers, 3)
p

0.078

# What is the Probability that the Customer is Retired and Divorced?
Joint Probability

In [55]:
pd.crosstab(cards['job'], cards['marital'], margins=True)

marital        divorced  married  single  unknown    All
job
admin.             1280     5253    3875       14  10422
blue-collar         728     6687    1825       14   9254
entrepreneur        179     1071     203        3   1456
housemaid           161      777     119        3   1060
management          331     2089     501        3   2924
retired             348     1274      93        5   1720
self-employed       133      904     379        5   1421
services            532     2294    1137        6   3969
student               9       41     824        1    875
technician          774     3670    2287       12   6743
unemployed          124      634     251        5   1014
unknown              13      234      74        9    330
All                4612    24928   11568       80  41188

In [56]:
retired_divorced = len(cards[(cards['job'] == 'retired') & (cards['marital'] == 'divorced')])
retired_divorced

348

In [58]:
p = round(retired_divorced / customers, 3)
p

0.008

# Given that the Customer has a credit card, find the probability the he/she is married?
Conditional Probability - probability of one event conditioning on another event

In [ ]:
# P(A|B) = P(AnB) / P(B)  # what is the probability of the customer being married given he has a credit card.
# P(A) - customer is married

In [59]:
cards.head(2)

,gender,age,job,marital,education,default,housing,loan,contact,CreditCard
0,female,56,housemaid,married,basic.4y,no,no,no,telephone,no
1,male,57,services,married,high.school,yes,no,no,telephone,no

In [68]:
has_card = len(cards[cards['CreditCard'] == 'yes'])
has_card

4640

In [69]:
is_married_has_card = len(cards[(cards['marital'] == 'married') & (cards['CreditCard'] == 'yes')])
is_married_has_card

2532

In [70]:
pd.crosstab(cards['marital'], cards['CreditCard'], margins=True)

CreditCard     no   yes    All
marital
divorced     4136   476   4612
married     22396  2532  24928
single       9948  1620  11568
unknown        68    12     80
All         36548  4640  41188

In [72]:
p = is_married_has_card/has_card
p

0.5456896551724137

# If a customer has a blue collar job, find the probability that he has a house
P(A) - has a house
P(B) - has a blue-collar job

In [73]:
cards.head(2)

,gender,age,job,marital,education,default,housing,loan,contact,CreditCard
0,female,56,housemaid,married,basic.4y,no,no,no,telephone,no
1,male,57,services,married,high.school,yes,no,no,telephone,no

In [78]:
job = len(cards[cards['job'] == 'blue-collar'])
job

9254

In [79]:
job_house = len(cards[(cards['job'] == 'blue-collar') & (cards['housing'] == 'yes')])
job_house

4950

In [81]:
pd.crosstab(cards['job'], cards['housing'], margins=True)

housing           no    yes    All
job
admin.          4636   5786  10422
blue-collar     4304   4950   9254
entrepreneur     641    815   1456
housemaid        491    569   1060
management      1363   1561   2924
retired          784    936   1720
self-employed    641    780   1421
services        1818   2151   3969
student          381    494    875
technician      2980   3763   6743
unemployed       430    584   1014
unknown          153    177    330
All            18622  22566  41188

In [80]:
p = job_house/job
p

0.5349038253728118

In [ ]:
pd.crosstab(data['Flood'])